/**
 * achievements.js
 * 実績リストのデータ構造を定義
 */

const achievementsData = [
    {
        category: "日常",
        items: [
            { id: "1-1", name: "二十歳になる" },
            { id: "1-2", name: "1時間散歩する" },
            { id: "1-3", name: "予定より1本前の電車に乗る" },
            { id: "1-4", name: "電車の扉が目の前で閉まり乗り損ねる" },
            { id: "1-5", name: "信号待ちで目の前のバスを逃がす" },
            { id: "1-6", name: "お酒を飲んだ" },
            { id: "1-7", name: "お酒で失敗する" },
            { id: "1-8", name: "髪を染める" },
            { id: "1-9", name: "プリクラを撮る" },
            { id: "1-10", name: "寝返りを打つ" },
            { id: "1-11", name: "前回の健康診断から身長が縮む" },
            { id: "1-12", name: "自分で目薬を入れる" },
        ]
    },
    {
        category: "運動",
        items: [
            { id: "2-1", name: "バク転を成功させる" },
            { id: "2-2", name: "30kgのお米を持つ" },
            { id: "2-3", name: "何かを買いにコンビニまでダッシュする" },
        ]
    },
    {
        category: "食事",
        items: [
            { id: "3-1", name: "次郎系ラーメンを食べる" },
            { id: "3-2", name: "ピザを1枚一人で食べる" },
            { id: "3-3", name: "朝昼夜の食事をコンビニで済ませる" },
        ]
    },
    {
        category: "交通",
        items: [
            { id: "4-1", name: "切符を買ったのに交通系ICで改札を通る" },
            { id: "4-2", name: "電車で寝過ごす" },
        ]
    },
    {
        category: "ゲーム",
        items: [
            { id: "5-1", name: "ツムツムプレイ中に寝落ちる。" },
            { id: "5-2", name: "音ゲー中に寝落ちる" },
        ]
    },
    {
        category: "非日常",
        items: [
            { id: "6-1", name: "盗んだバイクで走り出した（実際やられたら多少困るので歌うでも可）" },
            { id: "6-2", name: "献血をする" },
            { id: "6-3", name: "コロナにかかる" },
            
        ]
    },
    {
        category: "その他",
        items: [
            { id: "99-1", name: "シャベルで穴を掘る" },
            { id: "99-2", name: "PCを自分で稼いだお金で購入する" },
            { id: "99-3", name: "お金を稼いだ" },
        ]
    },
];